Revit 2024 API
BuiltInFailures.RebarFailures.RebarEndTreatmentOverHook Property
 Cannot set end treatment at an end that has hook.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RebarEndTreatmentOverHook { get; }
Visual Basic
Public Shared ReadOnly Property RebarEndTreatmentOverHook As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RebarEndTreatmentOverHook {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace